;***************************************************************
;* TMS320C2000 C/C++ Codegen                   PC Version 3.06 *
;* Date/Time created: Sun Mar 30 20:31:15 2003                 *
;***************************************************************
FP	.set	XAR2

DWCU	.dwtag  DW_TAG_compile_unit
	.dwattr DWCU, DW_AT_name("IQsample.cpp")
	.dwattr DWCU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC Version 3.06 Copyright (c) 1996-2002 Texas Instruments Incorporated")
	.dwattr DWCU, DW_AT_stmt_list(0x00)
	.dwattr DWCU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("printf"), DW_AT_symbol_name("_printf")
	.dwattr DW$1, DW_AT_type(*DWT$11)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1021)
DW$3	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$1


	.sect	".cinit"
	.align	1
	.field  	-2,16
	.field  	_GlobalQ+0,32
	.field  	24,32			; _GlobalQ @ 0

	.sect	".text"
	.global	_GlobalQ
_GlobalQ:	.usect	".ebss",2,1,1
DW$4	.dwtag  DW_TAG_variable, DW_AT_name("GlobalQ"), DW_AT_symbol_name("_GlobalQ")
	.dwattr DW$4, DW_AT_type(*DWT$13)
	.dwattr DW$4, DW_AT_location[DW_OP_addr _GlobalQ]
	.dwattr DW$4, DW_AT_external(0x01)

DW$5	.dwtag  DW_TAG_subprogram, DW_AT_name("operator new"), DW_AT_symbol_name("___nw__FUl")
	.dwattr DW$5, DW_AT_type(*DWT$3)
	.dwattr DW$5, DW_AT_declaration(0x01)
	.dwattr DW$5, DW_AT_external(0x01)

        MOVL      *+XAR4[AR0],ACC       ; |37| 
        MOVB      XAR0,#16              ; |37| 
        MOVL      *+XAR4[AR0],ACC       ; |37| 
	.dwpsn	"IQsample.cpp",136,1
        LRETR
        ; return occurs
	.dwendentry
	.dwendtag DW$100




	.sect	".pinit"
	.align	2
	.field	___sti__IQsample_cpp_GlobalQ, 22

	.sect	".text"
	.global	___sti__IQsample_cpp_GlobalQ

DW$101	.dwtag  DW_TAG_subprogram, DW_AT_name("__sti__IQsample_cpp_GlobalQ"), DW_AT_symbol_name("___sti__IQsample_cpp_GlobalQ")
	.dwattr DW$101, DW_AT_low_pc(___sti__IQsample_cpp_GlobalQ)
	.dwattr DW$101, DW_AT_high_pc(0x00)

	.dwfde DW$CIE

;***************************************************************
;* FNAME: ___sti__IQsample_cpp_GlobalQ  FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Parameter,  0 Auto,  0 SOE     *
;***************************************************************


;***************************************************************
;*                                                             *
;* Using -g (debug) with optimization (-o3) may disable key op *
;*                                                             *
;***************************************************************
___sti__IQsample_cpp_GlobalQ:
	.dwcfa	0x1c, 26, 0
	.dwcfa	0x09, 38, 26
	.dwpsn	"IQsample.cpp",38,3
        LCR       #___ct__10DATA_LOG_CFv ; |38| 
        ; call occurs [#___ct__10DATA_LOG_CFv] ; |38| 
	.dwpsn	"IQsample.cpp",51,3
        LCR       #___ct__4STEPFv       ; |51| 
        ; call occurs [#___ct__4STEPFv] ; |51| 
        LRETR
        ; return occurs
	.dwendentry
	.dwendtag DW$101



;***************************************************************
;* FAR STRINGS                                                 *
;***************************************************************
	.sect	".econst"
	.align	2
FSL1:	.string	10,"Enter waveform X gain (default = 1.0)= ",0
	.align	2
FSL2:	.string	10,"Enter waveform X freq (default = 1.0)= ",0
	.align	2
FSL3:	.string	10,"Enter waveform Y gain (default = 1.0)= ",0
	.align	2
FSL4:	.string	10,"Enter waveform Y freq (default = 1.0)= ",0
;***************************************************************
;* UNDEFINED EXTERNAL REFERENCES                               *
;***************************************************************
	.global	_printf
	.global	___nw__FUl
	.global	___anew
	.global	__IQ24atan2PU
	.global	__atoIQN
	.global	__IQ24mpyI32int
	.global	__IQ24mag
	.global	__IQ24div
	.global	_gets
	.global	__IQ24sin

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************
DWT$11	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DWT$11, DW_AT_encoding(DW_ATE_signed)
	.dwattr DWT$11, DW_AT_byte_size(0x01)
DWT$1018	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$11)
	.dwattr DWT$1018, DW_AT_address_class(0x16)
DWT$1027	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1019)
	.dwattr DWT$1027, DW_AT_address_class(0x16)
DWT$1021	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1020)
	.dwattr DWT$1021, DW_AT_address_class(0x16)

DWT$1053	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1019)
	.dwattr DWT$1053, DW_AT_byte_size(0x14)
DW$102	.dwtag  DW_TAG_subrange_type
	.dwattr DW$102, DW_AT_upper_bound(0x13)
	.dwendtag DWT$1053

DWT$10	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DWT$10, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$10, DW_AT_byte_size(0x01)
DWT$13	.dwtag  DW_TAG_base_type, DW_AT_name("long")
	.dwattr DWT$13, DW_AT_encoding(DW_ATE_signed)
	.dwattr DWT$13, DW_AT_byte_size(0x02)
DWT$12	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DWT$12, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$12, DW_AT_byte_size(0x02)
DWT$3	.dwtag  DW_TAG_pointer_type
	.dwattr DWT$3, DW_AT_address_class(0x16)

DWT$1072	.dwtag  DW_TAG_subroutine_type

DWT$1075	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$3)
DW$103	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$12)
	.dwendtag DWT$1075


DWT$1077	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$3)

DWT$1079	.dwtag  DW_TAG_subroutine_type
DW$104	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$105	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1021)
	.dwendtag DWT$1079


DWT$1080	.dwtag  DW_TAG_subroutine_type
DW$106	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$107	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
	.dwendtag DWT$1080


DWT$1082	.dwtag  DW_TAG_subroutine_type
DW$108	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$109	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$110	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
	.dwendtag DWT$1082


DWT$1084	.dwtag  DW_TAG_subroutine_type
DW$111	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$112	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1043)
DW$113	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1043)
	.dwendtag DWT$1084

DWT$1019	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DWT$1019, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DWT$1019, DW_AT_byte_size(0x01)
DW$114	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1019)
DWT$1020	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$114)

DWT$1106	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1027)
DW$115	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1027)
	.dwendtag DWT$1106


DWT$1041	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1041, DW_AT_name("iq")
	.dwattr DWT$1041, DW_AT_byte_size(0x02)
DW$116	.dwtag  DW_TAG_member, DW_AT_type(*DWT$13)
	.dwattr DW$116, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)

DW$117	.dwtag  DW_TAG_subprogram, DW_AT_name("iq"), DW_AT_symbol_name("___ct__2iqFv")
	.dwattr DW$117, DW_AT_declaration(0x01)
	.dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)

DW$118	.dwtag  DW_TAG_subprogram, DW_AT_name("iq"), DW_AT_symbol_name("___ct__2iqFl")
	.dwattr DW$118, DW_AT_declaration(0x01)
	.dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
DW$119	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
	.dwendtag DW$118


DW$120	.dwtag  DW_TAG_subprogram, DW_AT_name("iq"), DW_AT_symbol_name("___ct__2iqFRC2iq")
	.dwattr DW$120, DW_AT_declaration(0x01)
	.dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
DW$121	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1036)
	.dwendtag DW$120


DW$122	.dwtag  DW_TAG_subprogram, DW_AT_name("operator ="), DW_AT_symbol_name("___as__2iqFRC2iq")
	.dwattr DW$122, DW_AT_declaration(0x01)
	.dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
DW$123	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1036)
	.dwendtag DW$122


DW$124	.dwtag  DW_TAG_subprogram, DW_AT_name("operator +="), DW_AT_symbol_name("___apl__2iqFRC2iq")
	.dwattr DW$124, DW_AT_declaration(0x01)
	.dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
DW$125	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1036)
	.dwendtag DW$124


DW$126	.dwtag  DW_TAG_subprogram, DW_AT_name("operator -="), DW_AT_symbol_name("___ami__2iqFRC2iq")
	.dwattr DW$126, DW_AT_declaration(0x01)
	.dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
DW$127	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1036)
	.dwendtag DW$126


DW$128	.dwtag  DW_TAG_subprogram, DW_AT_name("operator *="), DW_AT_symbol_name("___amu__2iqFRC2iq")
	.dwattr DW$128, DW_AT_declaration(0x01)
	.dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
DW$129	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1036)
	.dwendtag DW$128


DW$130	.dwtag  DW_TAG_subprogram, DW_AT_name("operator /="), DW_AT_symbol_name("___adv__2iqFRC2iq")
	.dwattr DW$130, DW_AT_declaration(0x01)
	.dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
DW$131	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1036)
	.dwendtag DW$130


DW$132	.dwtag  DW_TAG_subprogram, DW_AT_name("operator &="), DW_AT_symbol_name("___aad__2iqFRCl")
	.dwattr DW$132, DW_AT_declaration(0x01)
	.dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
DW$133	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1039)
	.dwendtag DW$132


DW$134	.dwtag  DW_TAG_subprogram, DW_AT_name("operator |="), DW_AT_symbol_name("___aor__2iqFRCl")
	.dwattr DW$134, DW_AT_declaration(0x01)
	.dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
DW$135	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1039)
	.dwendtag DW$134


DW$136	.dwtag  DW_TAG_subprogram, DW_AT_name("operator ^="), DW_AT_symbol_name("___aer__2iqFRCl")
	.dwattr DW$136, DW_AT_declaration(0x01)
	.dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
DW$137	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1039)
	.dwendtag DW$136

	.dwendtag DWT$1041

DWT$1036	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1035)
	.dwattr DWT$1036, DW_AT_address_class(0x16)
DWT$1043	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1042)
	.dwattr DWT$1043, DW_AT_address_class(0x16)
DW$138	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1041)
DWT$1044	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$138)
DWT$1066	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1041)
	.dwattr DWT$1066, DW_AT_address_class(0x16)

DWT$1087	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$13)
DW$139	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
	.dwendtag DWT$1087


DWT$1088	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$13)
DW$140	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
DW$141	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
DW$142	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$11)
	.dwendtag DWT$1088


DWT$1089	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$13)
DW$143	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
DW$144	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
	.dwendtag DWT$1089


DWT$1090	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$13)
DW$145	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1021)
DW$146	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
	.dwendtag DWT$1090


DWT$1091	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$13)
DW$147	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$148	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
	.dwendtag DWT$1091

DW$149	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1066)
DWT$1092	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$149)

DWT$1095	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1032)
DW$150	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
	.dwendtag DWT$1095


DWT$1097	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1032)
DW$151	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$152	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$13)
	.dwendtag DWT$1097


DWT$1098	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1032)
DW$153	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1066)
DW$154	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1043)
	.dwendtag DWT$1098


DWT$1101	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1032)
DW$155	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1099)
DW$156	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1043)
	.dwendtag DWT$1101


DWT$1108	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$11)
DW$157	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1021)
DW$158	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DWT$1108


DWT$1109	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$11)

DWT$1112	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$4)
DW$159	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1043)
DW$160	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1043)
	.dwendtag DWT$1112


DWT$1119	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1119, DW_AT_name("DATA_LOG_C")
	.dwattr DWT$1119, DW_AT_byte_size(0x800)
DW$161	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1102)
	.dwattr DW$161, DW_AT_name("Xwaveform"), DW_AT_symbol_name("_Xwaveform")
	.dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
DW$162	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1102)
	.dwattr DW$162, DW_AT_name("Ywaveform"), DW_AT_symbol_name("_Ywaveform")
	.dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
DW$163	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1113)
	.dwattr DW$163, DW_AT_name("Phase"), DW_AT_symbol_name("_Phase")
	.dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
	.dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
DW$164	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1102)
	.dwattr DW$164, DW_AT_name("Mag"), DW_AT_symbol_name("_Mag")
	.dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x600]
	.dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)

DW$165	.dwtag  DW_TAG_subprogram, DW_AT_name("DATA_LOG_C"), DW_AT_symbol_name("___ct__10DATA_LOG_CFv")
	.dwattr DW$165, DW_AT_declaration(0x01)
	.dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)

DW$166	.dwtag  DW_TAG_subprogram, DW_AT_name("DATA_LOG_C"), DW_AT_symbol_name("___ct__10DATA_LOG_CFRC10DATA_LOG_C")
	.dwattr DW$166, DW_AT_declaration(0x01)
	.dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
DW$167	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1117)
	.dwendtag DW$166


DW$168	.dwtag  DW_TAG_subprogram, DW_AT_name("operator ="), DW_AT_symbol_name("___as__10DATA_LOG_CFRC10DATA_LOG_C")
	.dwattr DW$168, DW_AT_declaration(0x01)
	.dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
DW$169	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1117)
	.dwendtag DW$168

	.dwendtag DWT$1119

DWT$1117	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1116)
	.dwattr DWT$1117, DW_AT_address_class(0x16)

DWT$1125	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1114)
DW$170	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1123)
	.dwendtag DWT$1125

DWT$1123	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1119)
	.dwattr DWT$1123, DW_AT_address_class(0x16)

DWT$1133	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1133, DW_AT_name("STEP")
	.dwattr DWT$1133, DW_AT_byte_size(0x12)
DW$171	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$171, DW_AT_name("Xsize"), DW_AT_symbol_name("_Xsize")
	.dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
DW$172	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$172, DW_AT_name("Ysize"), DW_AT_symbol_name("_Ysize")
	.dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
DW$173	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$173, DW_AT_name("Yoffset"), DW_AT_symbol_name("_Yoffset")
	.dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
DW$174	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$174, DW_AT_name("X"), DW_AT_symbol_name("_X")
	.dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
DW$175	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$175, DW_AT_name("Y"), DW_AT_symbol_name("_Y")
	.dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
DW$176	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$176, DW_AT_name("GainX"), DW_AT_symbol_name("_GainX")
	.dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
DW$177	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$177, DW_AT_name("GainY"), DW_AT_symbol_name("_GainY")
	.dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
DW$178	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$178, DW_AT_name("FreqX"), DW_AT_symbol_name("_FreqX")
	.dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
DW$179	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$179, DW_AT_name("FreqY"), DW_AT_symbol_name("_FreqY")
	.dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)

DW$180	.dwtag  DW_TAG_subprogram, DW_AT_name("STEP"), DW_AT_symbol_name("___ct__4STEPFv")
	.dwattr DW$180, DW_AT_declaration(0x01)
	.dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)

DW$181	.dwtag  DW_TAG_subprogram, DW_AT_name("STEP"), DW_AT_symbol_name("___ct__4STEPFRC4STEP")
	.dwattr DW$181, DW_AT_declaration(0x01)
	.dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
DW$182	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1131)
	.dwendtag DW$181


DW$183	.dwtag  DW_TAG_subprogram, DW_AT_name("operator ="), DW_AT_symbol_name("___as__4STEPFRC4STEP")
	.dwattr DW$183, DW_AT_declaration(0x01)
	.dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
DW$184	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1131)
	.dwendtag DW$183

	.dwendtag DWT$1133

DWT$1131	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1130)
	.dwattr DWT$1131, DW_AT_address_class(0x16)

DWT$1138	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1128)
DW$185	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1136)
	.dwendtag DWT$1138

DWT$1136	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1133)
	.dwattr DWT$1136, DW_AT_address_class(0x16)
DWT$4	.dwtag  DW_TAG_base_type, DW_AT_name("bool")
	.dwattr DWT$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr DWT$4, DW_AT_byte_size(0x01)
DWT$1039	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1038)
	.dwattr DWT$1039, DW_AT_address_class(0x16)
DW$186	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$13)
DWT$1038	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$186)

DWT$1113	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$13)
	.dwattr DWT$1113, DW_AT_byte_size(0x200)
DW$187	.dwtag  DW_TAG_subrange_type
	.dwattr DW$187, DW_AT_upper_bound(0xff)
	.dwendtag DWT$1113

DWT$1032	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1041)
	.dwattr DWT$1032, DW_AT_address_class(0x16)
DW$188	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1041)
DWT$1035	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$188)
DW$189	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1041)
DWT$1042	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$189)
DW$190	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1066)
DWT$1099	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$190)

DWT$1102	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1041)
	.dwattr DWT$1102, DW_AT_byte_size(0x200)
DW$191	.dwtag  DW_TAG_subrange_type
	.dwattr DW$191, DW_AT_upper_bound(0xff)
	.dwendtag DWT$1102

DWT$1114	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1119)
	.dwattr DWT$1114, DW_AT_address_class(0x16)
DW$192	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1119)
DWT$1116	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$192)
DWT$1128	.dwtag  DW_TAG_reference_type, DW_AT_type(*DWT$1133)
	.dwattr DWT$1128, DW_AT_address_class(0x16)
DW$193	.dwtag  DW_TAG_far_type, DW_AT_type(*DWT$1133)
DWT$1130	.dwtag  DW_TAG_const_type, DW_AT_type(*DW$193)

	.dwattr DW$132, DW_AT_type(*DWT$1032)
	.dwattr DW$130, DW_AT_type(*DWT$1032)
	.dwattr DW$136, DW_AT_type(*DWT$1032)
	.dwattr DW$126, DW_AT_type(*DWT$1032)
	.dwattr DW$128, DW_AT_type(*DWT$1032)
	.dwattr DW$134, DW_AT_type(*DWT$1032)
	.dwattr DW$124, DW_AT_type(*DWT$1032)
	.dwattr DW$168, DW_AT_type(*DWT$1114)
	.dwattr DW$122, DW_AT_type(*DWT$1032)
	.dwattr DW$183, DW_AT_type(*DWT$1128)
	.dwattr DW$166, DW_AT_type(*DWT$1114)
	.dwattr DW$99, DW_AT_specification(*DW$165)
	.dwattr DW$165, DW_AT_type(*DWT$1114)
	.dwattr DW$120, DW_AT_type(*DWT$1032)
	.dwattr DW$118, DW_AT_type(*DWT$1032)
	.dwattr DW$35, DW_AT_specification(*DW$117)
	.dwattr DW$117, DW_AT_type(*DWT$1032)
	.dwattr DW$181, DW_AT_type(*DWT$1128)
	.dwattr DW$100, DW_AT_specification(*DW$180)
	.dwattr DW$180, DW_AT_type(*DWT$1128)
	.dwattr DW$101, DW_AT_external(0x01)
	.dwattr DW$66, DW_AT_external(0x01)
	.dwattr DW$66, DW_AT_type(*DWT$11)
	.dwattr DWCU, DW_AT_language(DW_LANG_C_plus_plus)

;***************************************************************
